magic_substrate = obj {
	nam = 'Магический субстрат';
	inv = [[
		Ты взвешиваешь в руке мешочек со злополучным порошком. По весу тянет на петлю.
		^
		Во время службы в армии тебе доводилось сталкиваться с людьми, не понаслышке
		знакомыми с этой штукой. От них ты наслушался всяких рассказов:
		от историй про зависимость и помутнение разума до диких баек про галлюцинации
		и даже мутации у принимавших большие дозы.
		Из всего этого ты пришёл к выводу, что субстрат не зря запрещён практически
		во всех государствах людей.
	]];
}
