holy_sign = obj {
	nam = 'Дорожный камень Благих';
	dsc = [[
		На краю площади стоит {дорожный камень Благих}.
	]];
	act = [[
		Ты на ходу бросаешь беглый взгляд на камень. Огромный булыжник грозно
		возвышается перед тобой в лучах солнца. В грубо высеченном углублении
		под изображениями Благих -- алтаре -- лежат свежие подношения богам.
		Раньше тебе приходилось не раз наблюдать подобные камни, покровители
		странников, на перекрёстках дорог, но ты никогда ещё не видел в них
		подношений подобных этому. В лучах солнца что-то призывно сверкает.
		Ты решительно направляешься к камню. Но стоит тебе подойти ближе, как
		солнце скрывается за облаками, и ты видишь в углублении лишь
		дымящийся огарок потухшей свечи. Остаётся только догадываться,
		кто в деревне мог встать среди ночи, чтобы зажечь свечу и
		отправиться в путь.
		^
		Задумчиво глядя на свечу, ты представляешь как на её фитиле теплится
		подрагивающий огонёк. Ты готов поклясться, что тебе померещилось
		нечто совершенно другое, что-то драгоценное...
		^
		"Мне определённо пора бросать пить," -- заключаешь ты.
	]];
}
