holy_sign = obj {
	nam = 'Дорожный камень Благих';
	dsc = [[
		На краю площади стоит {дорожный камень Благих}.
	]];
	-- "Кто-то в деревне вообще не спал сегодня?" Это как? Спал ли кто-то? Бодрствовал ли кто-то? Или речь вообще не о том?
	act = [[
		Ты на ходу бросаешь беглый взгляд на камень. Огромный булыжник грозно
		возвышается перед тобой в лучах солнца. В грубо высеченном углублении
		под изображениями Благих -- алтаре -- лежат свежие подношения богам.
		Раньше тебе приходилось	не раз наблюдать подобные камни, покровители
		странников, на перекрёстках дорог, но ты никогда ещё не видел в них
		подношений подобных этому. В лучах солнца что-то призывно сверкает.
		Ты решительно направляешься к камню. Но стоит подойти ближе, как
		солнце скрывается за облаками, и ты видишь в углублении лишь
		дымящийся огарок свечи. Кто-то в деревне вообще не спал сегодня?
		Ты готов поклясться, что видел нечто совершенно другое, нечто
		драгоценное...
		^
		"Мне определённо нужно меньше пить," -- заключаешь ты.
	]];
}