holy_sign = obj {
	nam = 'Дорожный знак Благих';
	dsc = [[
		На краю площади стоит {дорожный знак Благих}.
	]];
	act = [[
		Ты внимательно рассматриваешь знак. "Направо -- спасение, налево -- погибель".
		Какое-то предчувствие неожиданно подкрадывается к тебе. Ты видел этот
		знак уже тысячу раз, но сегодня он выглядит каким-то... загадочным?
		мистическим? туманным? Облака на секунду закрывают солнце, и тебе
		вдруг кажется, будто это конец мира; будто солнце не вернётся уже
		никогда.
		^
		"Мне определённо нужно меньше пить," -- заключаешь ты.
	]];
}
