well = obj {
	nam = 'Колодец';
	dsc = [[
		В середине площади стоит {колодец}.
	]];
	act = [[
		Ты нехотя рассматриваешь колодец. Внезапно в голову приходит странная
		мысль. Пока ты жил в деревне, тебе ещё ни разу не приходилось видеть,
		чтобы из колодца набирали воду. Всё поселение, и ты в том числе,
		предпочитали ходить с вёдрами к ближайшему ручью.
		^
		Кладка колодца слегка потрескалась, но в целом он неплохо выглядит.
		Ты подходишь ближе, чтобы заглянуть внутрь. Через минуту ты идёшь
		прочь от колодца лишь с одной мыслью в голове:
		^
		"Похоже на бездну."
	]];
}
