the_end_in_scaffold = room {
	nam = 'The End';
	dsc = [[
		Глашатай оглашает твоё преступление.
		^
		-- Обвиняется в убийстве советника Конроя, которого мы помник как талантливого
		военачальника...
		^
		На этот раз толпа взрывается,
		лица становятся похожи друг на друга. В тебя летят грязь и камни,
		но ты воспринимаешь это как должное.
		^
		^
		Перед тобой ставят корзину. Из корзины на тебя смотрят стелянными глазами
		глашатай и менестрель.
		^
		Что ж видимо вот оно, твоё место в этом мире -- на плахе.
		Есть на свете такие люди, для которых уготовано отдельное течение жизни.
		Оно подхватывает их и несёт в никуда, хотят они того или нет.
		А если они найдуи в себе смелость бороться с течением, оно лишь
		ускорит свой ход. Можно ли причислить тебя к числу смелых и борющихся?
		Ты так и не находишь ответ на этот вопрос.
		^
		-- Вот и всё, армейский пёс, -- только и успел прошептать ты, глядя на доски эшафота.
		^
		Меч просвистел в воздухе и с тупым стуком вонзился в дерево плахи.
		Отделившись от тела твоя голова полетела на эшафот мимо заготовленной корзины.
		Даже в ней тебе не нашлось места. Докатившись до края, голова в последний
		раз явила лицо недосегаемому небу и рухнула вниз.
	]];
}
