the_end_in_scaffold = room {
	nam = 'Конец';
	dsc = [[
		Что ж видимо вот оно, твоё место в этом мире -- на плахе.
		Есть на свете такие люди, для которых уготовано отдельное течение жизни.
		Оно подхватывает их и несёт в никуда, хотят они того или нет.
		А если они найдуи в себе смелость бороться с течением, оно лишь
		ускорит свой ход. Можно ли причислить тебя к числу смелых и борющихся?
		Ты так и не находишь ответ на этот вопрос.
		^
		-- Вот и всё, армейский пёс, -- только и успел прошептать ты, глядя на доски эшафота.
		^
		Меч просвистел в воздухе и с тупым стуком вонзился в дерево плахи.
		Отделившись от тела твоя голова полетела на эшафот мимо заготовленной корзины.
		Даже в ней тебе не нашлось места. Докатившись до края, голова в последний
		раз явила лицо недосегаемому небу и рухнула вниз.
	]];
}
