forest_edge = room {
	nam = 'Край леса';
	dsc = [[
		Оставив деревню позади, ты вышел к краю леса. За время последней войны его
		обитатели понесли потери сравнимые с иными армиями. Олени и кабаны ушли
		в самую чащу. Хищники же, напротив, бродят по окрайне в поисках двуногой добычи.
		^
		Местный лорд наложил запрет на охоту в глубине леса, сделав исключение лишь
		для знати. За убийство оленя теперь можно выложить крупную сумму,
		а то и вовсе потерять голову на плахе.
		^
		Ты даёшь себе очередное обещание не стрелять ни во что крупнее куропатки.
	]];
	way = {
		'private_lands';
	};
}
