afterparty = room {
	nam = 'У пещеры';
	dsc = [[
		Путь по тоннелю занимает некоторое время, хотя ты и торопишься. Выход из пещеры
		основательно зарос корнями деревьев и папоротником. Продравшись сквозь заросли,
		ты оказываешься в устье давно пересохшей реки, берега которой обрамляет
		частокол скрюченных деревьев.
		^
		Свежий воздух бьёт тебе в голову не хуже, чем крепкое вино. Внезапно ты
		обнаруживаешь себя лежащим на земле. По лицу у тебя снуют муравьи, а от темени
		растекается приятное тепло. Внезапная боль в затылке приводит тебя в чувства.
		Морщась, ты хочешь подняться, но осознаёшь, что тебя схватили за
		ногу и куда-то волокут.
		^
		Ты слышишь грубый говор на каком-то утробном языке и делаешь удивительный
		вывод, что попался в лапы отнюдь не людям лорда. После пары резких брыканий
		на тебя обращают внимание, а речь становится более-менее понятной.
		^
		-- Ты совсем отощал, Грок? Уже не можешь по-орочьи вырубить жалкого людишку?
		^
		-- Жалкого? Не ты ли, Снаг, уверял меня, что он сойдёт за раба?
		^
		Превосходно, тебя поймали урук-хай. Далеко же их банду завела охота на живой
		товар. Граница с Режимом совсем близко.
		^
		-- Сойдёт на пару дней. Не веришь, устрой им бой с мелким крысёнышом.
		^
		-- Начальник отрубил Закрагу его кха, когда тот стравил пару задохликов
		из деревни. Вроде как человечки ему нужны будут.
		^
		-- Потому-то я и не дал тебе снести башку этому. А у Закрага кха растёт
		между плеч, а не ног. Начальник не там рубил!
		^
		Урук громко захохотали. Если они расчитывали на то, что их разговор тебя
		припугнёт, то были правы. Они что-то говорили про деревню.
		Рядом с лесом только одна деревня -- твоя. Значит банда разорила её и
		устроила на пепелище временный лагерь. Теперь вместо дома тебя там ждёт
		рабский загон с бедолагами пережившими набег.
		^
		Оставшуюся дорогу ты собирался занять себя подсчётом корней и кочек, но
		урук, что тебя тащил, для сохранности товарного вида закинул тебя на плечо.
		Пришлось наслаждаться орочьей вонью и гадать, где лучше в рабстве или
		застенках лорда.
	]];
	way = {
		'uh_prison';
	};
}
