afterparty = room {
	nam = 'У пещеры';
	dsc = [[
		Путь по тоннелю занимает некоторое время, хотя ты и торопишься. Выход из пещеры
		основательно зарос корнями деревьев и папоротником. Продравшись сквозь заросли,
		ты оказываешься в устье давно пересохшей реки, берега которой обрамляет
		частокол скрюченных деревьев.
		^
		Свежий воздух бьёт тебе в голову, не хуже чем крепкое вино. Внезапно ты
		обнаруживаешь себя лежащим на земле. По лицу у тебя снуют муравьи, а от темени
		растекается приятное тепло. Внезапная боль в затылке приводит тебя в чувства.
		Ты морщишься и пытаешься подняться, но понимаешь, что тебя схватили за ногу 
		и куда-то волокут.
		^
		Ты слышишь грубый говор на каком-то утробном языке и делаешь удивительный
		вывод, что попался в лапы отнюдь не людям лорда. После пары резких брыканий
		на тебя обращают внимание.
		^
		...
		^
		После недолгих размышлений они хватают тебя и волокут с собой.
		По их разговорам ты понимаешь, что они захватили деревню и разбили
		там свой лагерь, а тебя бросят в яму к другим пленникам. Как мило.
	]];
	way = {
		'uh_prison';
	};
}
