home = room {
	nam = 'Твоя хижина';
	-- Какой "этот свет"? Перестроить предложение
	dsc = [[
		Вот уже несколько лет каждое утро ты задаёшься вопросом, что ты делаешь
		в этой глуши. Сегодняшнее утро не стало исключением.
		Ты проснулся рано, едва небо на востоке начало светлеть, а вместе с
		ним и потолок твоего ветхого жилища. После войны ты заселил
		эту заброшенную хижину с разрешения деревенского старосты.
		Ты особо не распространялся о своём прошлом, а тот,
		в свою очередь, не задавал лишних вопросов.
		^
		Минувшая война прокатилась по землям Приграничья волной запустения.
		Люди стремились в крупные города с их иллюзией безопасности. Поселения,
		избежавшие гибели в пламени факелов, сейчас ждала не менее печальная
		судьба.
		^
		Твоя деревенька не исключение. Жизнь в ней постепенно угасает, и она
		рада притоку свежей крови, пусть и сомнительного качества. Можно
		сказать, что тебе здесь были даже рады, по крайней мере своё место
		ты нашёл.
		^
		Так что пока это жильё в глуши тебя вполне устраивает.
	]];
	obj = {
		'hunting_gear';
		'food';
		'journal';
		'trophies';
		'diary';
		'posters';
	};
	way = {
		'square';
	};
}
