trophies = obj {
	nam = 'Боевые трофеи';
	dsc = [[
		^
		Стены хижины украшают {твои трофеи с войны}.
	]];
	act = [[
		В основном это оружие урук. Громоздкое, чудовищных размеров и форм,
		для использования человеком непригодное. Жемчужина коллекции -- голова
		урука на тяжёлой стадии превращения в одичалого. Страшно представить,
		как происходило её отделение от туловища...
		^
		Всё это нагоняет на тебя не самые приятные воспоминания о службе в армии
		и участии в войне. Большую часть трофеев ты "одолжил", в надежде, что
		сможешь когда-нибудь продать.
	]];
}
