capitan_docs = obj {
	nam = 'Бумаги капитана';
	inv = [[
		Ты похлопываешь ладонью по стальному панцирю в том месте, где припрятаны
		документы капитана.
		^
		!!!
		^
		В тоже время некоторые документы выглядят несколько подозрительно. Похоже, что
		капитан отчитывается не только перед лордами. А их заговор кто-то использует
		в своих целях. Тебе хорошо запомнился отрывок из одного письма:
		^
		"Ты много раз спрашивал в чём заключается источник истинного могущества.
		Нет, он не в колдовстве или тайном знании. Не в вечной жизни и многовековом опыте.
		Самое ценное умение -- указать судьбе её место. Властители этого мира находят
		пути использовать всё, что возможно, для достижения собственных целей:
		обыденные вещи и могущественные артефакты, отдельных людей и целые народы,
		события и историю в целом с её мифами и недосказонностями.
		Использовать поток судьбы как орудие для изменения мира в свою пользу --
		вот удел, к которому должно стремиться существу, обладающему разумом и волей.
		Даже среди представителей вашей расы можно найти достойные примеры.
		^
		Ты тоже не обделён некоторыми способностями. Доведи задуманное нами до конца,
		и, возможно, город в небесах откроет тебе некоторые из своих тайн.
		Используй содержимое шкатулки. Есть вещи, которые делают людей более
		сговорчивыми, даже если они из знатного рода."
		^
		Ты ловишь себя на мысли, что от выражений "представители вашей расы" и
		"город в небесах" у тебя по спине пробегает холодок. Тебе остаётся только
		догадываться, кто ещё мог направлять капитана, но ты предпочитаешь не
		думать об этом.
	]];
}
