capitan_docs = obj {
	nam = 'Бумаги капитана';
	inv = [[
		Ты извлекаешь небольшую кипу бумаг для изучения, и отмечаешь, что буквы
		на них всё ещё светятся.
		^
		Разбираясь в этом ворохе писем, приказов и записок, ты замечаешь, что строчки
		убористого почерка проскакивают перед глазами намного быстрей чем обычно.
		Иногда тебе попадаются какие-то шифры, но светящиеся символы послушно
		перетекают в осмысленные слова.
		^
		Все эти бумаги адресованы самым разным людям, да и автором далеко не всегда
		выступает капитан. Куда больше это походит на перехваченную переписку между
		несколькими представителями знати Режима и Приграничья. Из прочитанного ты делаешь
		вывод, что группа лордов собирается развязать небольшую войну, чтобы вытеснить
		режимников из региона и заново поделить часть земель Приграничья.
		^
		Тебе вспоминается вчерашняя карта в шатре главаря банды урук-хай.
		И кинжал, воткнутый в город. Письма подтверждают твои догадки. Капитан должен был
		нанять банду урук-хай, которая нападёт на город в ближайшее время и возьмёт его в
		осаду. Затем здешний лорд нанесёт оркам сокрушительное поражение и займёт город,
		подорвав влияние Режима. Схожие планы вынашиваются относительно других городов.
	]];
}
