guard_docs = obj {
	nam = 'Документы рекрута';
	inv = [[
		Ты внимательно рассматриваешь один из листов документа. Имя "Реджинальд Кирсон".
		Описание внешности местами совпадает с твоей. К счастью для тебя,
		портретов на документах солдат не делают -- вчитываться в строки
		текста просто так мало кто будет.
		^
		В документе также перечислены ближайшие родственники.
		Отец -- известный в городе торговец.
		Мать пропала без вести во время войны. Сестра одногодка.
		^
		В рекомендации рекрут значится как законопослушный и благонадёжный.
		^
		Документ заверен печатью Режима -- гербом с древом и книгой.
		^
		На втором листе аккуратно выведена характеристика рекрута. Ты догадывался о
		существовании подобных бумаг с оценкой благонадёжности и полезности
		будущих граждан Режима. Теперь довелось увидеть воочию.
		^
		Реджинальда Кирсона оценили невысоко, и, видимо, служба его будет всячески отягощена.
		В характеристике указано, что Кирсон старший имеет сомнительные связи среди
		местных преступных банд.
		Этот факт заставляет Режим сомневаться в благонадёжности всего семейства.
		^
		После недолгих раздумий, ты решаешь, что второй лист в этих стенах
		никому показывать не стоит.
	]];
}
