guard_letter = obj {
	nam = 'Письмо рекрута';
	inv = [[
		Ты разворачиваешь письмо, чтобы прочить его ещё раз.
		^
		^
		Дорогая, Кэйти.
		^
		Мне удалось стать рекрутом Режима. Или псом Режима, как их
		величает отец. Ещё раз прошу, ни слова ему, как мы и договаривались.
		Ты знаешь, я сам не рад своему решению, но не хватало ещё, чтобы
		отец заявился сюда, где куча солдат с оружием. Капитан штаба выглядит
		весьма великодушным командиром, но подписав мне бумаги, он отбыл
		на следующий же день. Мне сказали, что он редко бывает в штабе и
		вообще не следит за тем, что здесь происходит. Я уже
		заметил на себе оценивающие взгляды местных заправил-мордоворотов.
		Но не беспокойся, уроки Бриана не прошли даром, и в случае чего,
		я смогу постоять за себя.
		^
		Конечно, во многом отец был прав. Обстановка в штабе развеяла
		все мои иллюзии относительно безопасности города. Я видел старика
		богоизбранного -- это воин-развалина, не более. Он не может
		никем командовать. Солдаты за его спиной ведут себя развязно, и
		все эти городские слухи оказались правдой. Думаю, в гарнизоне
		городской стражи дела не лучше. В совете верят в помощь Режима,
		но никто не сможет защитить нашу страну кроме нас самих.
		Хотя пока в Приграничье нет короны, и нам это не под силу.
		^
		Я постараюсь поскорей проявить себя, чтобы капитан меня заметил
		и оценил по достоинству. Гражданство Режима даёт многое. Через год
		я продвинусь по службе и заберу тебя отсюда. Найду место
		и по-спокойнее. Отец связался с этой бандой воров и подонков.
		Он с нами не поедет, ты знаешь, его переубедить невозможно,
		но тебя я заберу, будь уверена. И возможно нам удастся сохранить хоть
		что-то от нашей семьи и её имени. Да помогут нам Благие.
		^
		^
		С любовью, твой брат Реджинальд.
		^
		^
		PS
		^
		Не сомневаюсь Бриан поступил бы также.
		^
		^
		-- Ничего в этом мире не меняется, -- с усмешкой думаешь ты, вспоминая как сам,
		когда-то подписывал свой Договор, лелея мечты о лучшей жизни. Хотя нет, тогда
		ты просто искал, хоть какой-нибудь жизни. Хотел прекратить
		бесконечные метания по окрестностям своего городишки,
		в ожидании когда банда урук придёт поживиться его добром.
		^
		-- Всё возвращается на круги своя, -- мелькает у тебя в голове.
	]];
}
