guard_docs = obj {
	nam = 'Документы рекрута';
	inv = [[
		Ты внимательно рассматриваешь документы. Имя "Реджинальд Кирсон".
		Описание внешности местами совпадает с твоей. К счастью для тебя,
		портретов на документах солдат не делают -- вчитываться в строки
		текста просто так мало кто будет.
		^
		В документе также перечислены ближайшие родственники.
		Отец -- известный в городе торговец.
		Мать пропала без вести во время войны. Cестра одногодка.
		^
		В рекомендации рекрут значится как законопослушный и благонадёжный.
		^
		Документ заверен печатью Режима -- гербом с древом и книгой.
		^
		^
		Вместе с документом ты прихватил также характеристику рекрута.
		Такие составляются...
		Неблагонадёжность...
		^
		Режим оценивает потенциальных граждан...
	]];
}
