posters = obj {
	nam = 'Коллекция плакатов "Разыскивается живым или мёртвым"';
	dsc = [[
		Помимо трофеев на стенах пестреют {плакаты из серии "Разыскивается живым или мёртвым"}.
		На каждом -- твой портрет и определённая денежная сумма. Ты бы и задницу
		со стула не поднял за такие деньги. Хотя...
	]];
	act = [[
		Ты разглядываешь плакаты. Родом из разных городов, разных авторов.
		Что удивительно, на отрисовку плакатов Режим привлекал весьма
		недурственных художников. А если вспомнить, что ты был далеко
		не единственным дезертиром -- выходит, что гонорар за плакаты мог
		превысить суммарную награду за поимку всех беглецов.
	]];
}
