halfed_by_panglolin = room {
	nam = 'Игра окончена';
	dsc = [[
		Ты двигаешься в сторону спасительного переулка, стараясь держаться от полуящера
		подальше и не привлекать его внимания. Первое время тебе это удаётся,
		но в какой-то момент рептилия в очередной раз принюхивается, после чего шипы у неё
		на загривке встают дыбом. Отбросив полуобглоданный труп в сторону,
		тварь c отвратительным визгом бросается в атаку.
		У неё -- когти и зубы, ты безоружен. Бой заканчивается невероятно быстро.
	]];
}
