slain_by_slave = room {
	nam = 'Игра окончена';
	dsc = [[
		Ты с подозрением поглядываешь на лысую макушку орка. Неожиданно голова поворачивается,
		являя тебе жуткую рожу с маленькими красными глазками. Орк хватается
		за эшафот и в миг выталкивает себя из-под помоста. Вскочив, он тут же пинком сбивает
		тебя с ног. Ты падаешь носом в землю и пытаешься перевернуться,
		но могучая рука стискивает шею и придавливает тебя к земле.
		Не обращая внимания на твои попытки вырваться, орк парой мощных
		ударов раскалывает тебе череп.
	]];
}
