uh_square = room {
	nam = 'Площадь лагеря';
	dsc = [[
		Ты лежишь у лагерного костра, надеясь, что тебя никто не спалит.
		Вокруг какие-то урки заняты своими делами: кто кивер чистит,
		весь избитый, кто штык точит, ворча сердито, кусая длинный ус.
		^
		Вдалеке виднеется тюрьма с дырой в заборе, на которую никто
		не обращает внимания.
		^
		Вокруг костра расставлены шатры. Один из них особенно выделяется:
		он красный, с перьями и бычьим черепом над входом.
	]];
	way = {
		'uh_prison';
		'uh_pavilion';
		'uh_pit';
	};
}
