killed_in_lane = room {
	nam = 'Игра окончена';
	dsc = [[
		От боли мир вокруг превращается в мешанину цветов.
		^
		Очнувшись, ты видишь перед собой богоизбранного с занесённым мечом.
		^
		-- Твоё последнее слово, дезертир, -- сипло шепчет он.
		^
		Но наполненный кровью рот, отказывается тебе повиноваться.
		^
		-- Нечего сказать? Так даже лучше, -- заключает палач.
		^
		Твой взгляд навсегда застывает на опускающемся клинке.
	]];
}

destroyed_in_lane = room {
	nam = 'Игра окончена';
	dsc = [[
		-- Теперь я знаю, что ты такое, -- твёрдо выговаривает старик,
		-- и как с тобой поступить.
		^
		Отчаянно извиваясь, похожий на червя на крючке, ты поднимаешь лицо к небу.
		Чернота туч освещается изнутри, оголяя свои уродливые внутренности.
		Низкие раскаты грома, пресекает вспышка света.
		Она выжигает все твои чувства без остатка.
	]];
}
