-- Локации
-- Конец
the_end = room {
	nam = 'В темноте';
	dsc = [[
		Одним движением ты откидываешь решётку коллектора,
		обнажая жерло канализации.
		Справиться с решётой оказывается куда проще, чем заглянуть в открывшийся провал.
		Ты бросаешь прощальный взгляд на руины вокруг и тёмное небо над головой.
		Звуки, раздающиеся из-под завала, придают тебе решимости.
		Глубоко вдохнув, ты опираешься на мощёные края колодца и погружаешься во тьму,
		пытаясь нащупать ногами скобы спуска.
		Осторожными движениями, ты проталкиваешь себя всё глубже и глубже под землю.
		^
		В конце концов скобы заканчиваются,
		и тебе ничего не остаётся как повиснуть на руках над невидимой пропастью.
		Собравшись с силами, ты разживаешь скользящие пальцы.
		^
		Ноги подводят тебя, и твоё приземление заканчивается на четвереньках в грязи.
		Ты оказываешься в мире, населяемым приглушённым звуком,
		засасывающим запахом и тошнотворным осязанием.
		Оправившись, ты отправляешься на поиски ближайшей стены.
		Она довольно долго играет с тобой в прятки, но всё же отыскивается.
		Ты решаешь, что лучше идти держась за стену,
		и начинаешь уверенно вышагивать прочь от призрачного столба света.
		^
		-- Всё кончилось? -- спрашиваешь ты сам себя спустя сотню шагов.
		^
		-- Кажется, кончилось, не считая того, что ещё нужно как-то выбраться отсюда,
		-- думаешь ты.
		^
		Вторя объятиям тьмы, мысли окружают твоё сознание.
		Твой разум начинает подтачивать выяснение причин.
		Как так вышло, что ты оказался под землёй?
		Лишённый зрения, избитый, измождённый, терзаемый голодом,
		и без малейшего представления куда двигаться дальше.
		Впрочем, разве ты в первый раз в такой ситуации?
		Уже долгое время ты живёшь без каких либо планов,
		сливая время в один длинный день.
		Ты даже не можешь вспомнить сколько именно лет ты живёшь именно так.
		Как давно ты дезертировал?
		Люди ещё помнят о той войне, значит, наверное, пару тройку лет назад.
		Гораздо больше тебя волнует, что ты не помнишь почему дезертировал.
		Эти события стрёлись из памяти, хотя саму службу ты помнишь хорошо.
		^
		Твоя бытность солдатом была куда ясней, чем то, что наступило после.
		Дни разграничивались приказами.
		Марши сменялись боями, а бои сменялись подготовкой к новым маршам.
		У городов и деревень были названия, а тебя окружали люди с именами.
		Ты был винтиком в машине, где всё было отмерено:
		паёк и снаряжение, друзья-сослуживцы и девушки, боль и смерть.
		Но ничто не вечно, даже война. Ты должен был это понимать.
		И наверное, именно этого ты и боялся тогда.
		Боялся лишиться этой ясности.
		^
		Поток твоих размышлений неожиданно прерывается, когда ты осознаёшь,
		что уже продолжительное время идёшь, не касаясь стены.
		Проклятая стена уже давно куда-то пропала, и ты просто бродишь в темноте.
		^
		Если эта стена вообще когда-то была.
		Может быть ты так и не нашёл того старика, который дал тебе ключ от башни?
		Может ничего не было, ни похода к советнику, ни эшафота, ни горящего города?
		Ты вышел из лагеря подполья и теперь скитаешься по тоннелям,
		сходя с ума от голода и галлюцинируя.
		^
		Нет, это бред какой-то.
		Мир именно то, что он есть, и его нужно воспринимать как данность.
		Что было, то и случилось, не нужно выдумывать никаких сомнительных историй.
		^
		Если бы ты когда-нибудь писал книгу, то назвал бы её Книга Сомнений.
		Каждый новый абзац опровергал бы в ней предыдущий.
		Ты бы написал её от лица гомункула.
		Тот маг-крыса рассказывал тебе историю о них.
		В Магосе пытались создавать гомункулов -- искусственных людей.
		Их выращивали как растения и вливали в головы ложные воспоминания,
		ведь человек не может нормально существовать без воспоминаний.
		А потом, какой-то безумный маг выпустил их всех на свободу,
		утаив от них их происхождение.
		В своей книге бы ты написал о скитаних такого лже-человека.
		В какой-то момент, он бы начал ощущать своё отличие от прочих людей.
		В него закралось бы сомнение, всё ли что он помнит -- правда.
		^
		Ты вдруг останавливаешься как вкопанный, копаясь у себя в голове.
		Маг-крыса никогда не рассказывал тебе подобной истории.
		Нет, ты точно бредишь сейчас, ты не ел два дня. Ты вымотан.
		^
		Голод всему виной.
		Если бы не та охота, на которую ты отправился вчера,
		то ничего бы этого и не случилось бы.
		Но разве у тебя был выбор? Тебе же просто нечего было есть.
		И к тому же, орки всё равно захватили бы твою деревню, и ты оказался бы в клетке.
		Нет, у тебя никогда не было выбора.
		Ты стал солдатом, потому что участились нападения орков.
		Среди вооружённых людей было больше шансов выжить, чем среди невооружённых.
		Ты стал режником, потому что, армия Режима была куда мощней, чем армия Приграничья.
		^
		Ты занимался только тем, что выполнял приказы. А потом ты дезертировал.
		Но по-сути ничего не изменилось. Ты был вынужден скрываться.
		Последние два дня ты снова исполнял чужую волю: помогал магу и подполью.
		Которые, кстати, выставляли себя не теми, кем были на самом деле.
		^
		А может быть, ты просто недостаточно старался?
		Если бы ты действительно хотел помешать планам капитана, ты приложил бы больше усилий.
		Но твоё вмешательство ни к чему не привело. Город всё равно сгорел.
		Ты ничего не изменил. И всё же ты лукавишь.
		Тебе всегда было плевать на город и его жителей.
		И на подполье и их борьбу тоже было плевать.
		Ты всего лишь хотел выпутаться из этой истории.
		И ты добился своей цели. А капитан добился своей.
		Выходит вы действовали заодно?
		Глупость. Каждый действовал в своих интересах.
		И в этом вы похожи. Основное различие между вами в том,
		что за интересами капитана стоят амбиции,
		а за твоими -- равнодушие. Тебе всё равно,
		что произойдёт с окружающими, с городом и со всем Приграничьем.
		Ты готов отдать этот мир таким как капитан.
		^
		Как червь ты зарываешься всё глубже и глубже в себя.
		^
		Червь. Это слово оставило в сознании склизкий след. Откуда оно вылезло?
		Кажется, ты слышал его совсем недавно. Остальные слова вертятся на языке.
		^
		^
		<i>Чёрный Червь ползёт во тьме,
		^
		поклоняясь пустоте,
		^
		такова судьба Червя,
		^
		вновь рождаться из огня,</i>
		^
		^
		Только сейчас ты обращаешь внимание, что твой амулет-оберег испускает слабый свет.
		Камень в руках карлика сияет крошечной звездой, освещая подземелье.
		И оно вовсе не похоже на тонелль коллектора.
		Ты оказался в огромной пещере. Усиливаясь, свет бъёт тебе по глазам,
		но этого всё равно не хватает, чтобы осветить свод и стены пещеры.
		Хотя одну стену тебе разглядеть всё же удаётся.
		Это цельная скала, в которой зияет проход, пожирающий свет твоего амулета.
		Стена изрезана замысловатым орнаментом.
		Ты пытаешься разглядывать его, чтобы разобрать отдельные элементы,
		но очень скоро у тебя начинает кружиться голова, и подкашиваться ноги.
		^
		И всё же ты делаешь несколько шагов вперёд,
		а губы твои шепчут странные слова:
		^
		^
		<i>Чтобы ночью править бал,
		^
		Червь был создан очень мал,
		^
		Но в глуши запретных мест,
		^
		Червь поднимет Бога перст.</i>
		^
		^
		Но это меньшее из того, что тревожит тебя.
		Куда больше беспокойства вызывает чувство,
		от которого ты не можешь отделаться последние два дня.
		Что-то или кто-то читает твои мысли.
		И здесь, под землёй, ты ощущаешь это гораздо более отчётливо.
		Прямо сейчас из твоей памяти читают очередные слова.
		^
		^
		<i>И проснувшись под горой,
		^
		Бог разрушит смертный строй,
		^
		погрузит он мир во мрак,
		^
		прославляя смерти шаг.</i>
		^
		^
		Ты стоишь перед воротами, вырезанными в скале.
		Стоит ли тебе спускаться глубже, чтобы найти выход на поверхность?
		То, что читает твои мысли, часто подталкивало тебя к действиям раньше.
		Может быть и сейчас, оно даст тебе подсказку?
		^
		С невидящим взором, устремлённым внутрь себя,
		ты замираешь на пороге чёрной пропасти.
		^
		^
		2016-2020
	]];
	obj = {
		'to_credits';
	};
	entered = function()
		-- Clear inventory, add whitelisted items
		inv():zap();
	end;
}

-- Титры
credits = room {
	nam = 'Над игрой работали';
	dsc = [[
		<b>m1kc</b> -- автор идеи, HR, программирование, корректура.
		^
		<b>FaNat1zM</b> -- гейм-дизайн, текст, разработка.
		^
		^
		<b>3bl3gamer</b> -- программирование некоторых локаций.
		^
		<b>houjing</b> -- программирование некоторых локаций.
		^
		^
		Мы в соцсетях:
		^
		Наши проекты:
	]];
}

-- Объекты
-- Переход к титрам
to_credits = obj {
	nam = 'К титрам';
	dsc = [[
		{О создателях}.
	]];
	act = function()
		walk 'credits';
	end;
}
