-- Локация
tower_stage5_adviser_room = room {
	nam = 'Комната советника';
	dsc = [[
		После пары вращений ключом в замке тебе удаётся совладать с дверью.
		Осторожно приоткрыв её, ты протискиваешься внутрь.
		^
		Эта комната заметно уступает в убранстве предыдущей, но выглядит не
		менее приятно. Здесь так же есть кровать, пара стульев, шкаф, тумбочка
		и большой письменный стол. Рядом со столом и замер седобородный старик
		с книгой в руке. Он смотрит на тебя с таким возмущением, что ты
		теряешь дар речи.
		^
		-- Интересно будет знать, как вы вошли?! -- гневно восклицает старик.
		^
		-- Советник, Конрой? -- шёпотом выдавливаешь ты из себя.
		^
		-- Да, это я. А кто вы такой, и что вы делаете в моих личных покоях?
		-- советник тоже переходит на шёпот, только этот шёпот в отличие от твоего
		прекрасно слышно, -- что, наместник прислал вас за мной, чтобы сопроводить
		на эшафот? Я надеялся, что конвой будет более солидный, и за мной пошлют
		хотя бы этого богоизбранного.
		^
		-- О, не беспокойтесь, советник, я не совсем солдат Режима, -- начинаешь оправдываться ты.
		^
		-- Как это понимать, не совсем солдат? Один сапог на вас армейский, а второй
		-- гражданский? -- продолжает кипятиться старик.
		^
		-- Послушайте, -- ты собираешься с мыслями, -- у нас очень мало времени, а я не мастер
		объяснений.
		^
		Ты поспешно достаёшь из-под нагрудника кипу документов, роняя несколько страниц на пол.
		^
		-- Речь идёт о заговоре. Заговоре против Режима и против города! -- быстро
		говоришь ты, протягивая старику бумаги, -- вот, это переписка некоторых знатных лордов
		Приграничья и здешнего капитана Режима. Они планируют нападение на город. Возможно,
		это случится уже сегодня.
		^
		-- Что за вздор вы несёте? -- взрывается советник, но тут же успокаивается, -- ладно,
		кладите ваши бумаги.
		^
		Ты водружаешь документы на стол. Старик кладёт книгу на тумбочку и подходит к тебе.
		^
		-- Так, что у нас тут, -- он начинает ловко разбирать стопку писем и бумаг, пробегая
		по ним глазами и раскладывая по столу. Старческие узловатые руки двигаются с завидной
		быстротой.
		^
		-- Все эти письма как будто настоящие. А фамилии и имена хорошо мне известны,
		-- задумчиво произносит старик, -- мне потребуется время, чтобы изучить всё это как следует.
		^
		-- Боюсь, у нас мало времени, советник, -- произносишь ты.
		^
		-- Даже не знаю, что я могу сделать прямо сейчас, -- сокрушается он, -- если всё, что вы говорите
		правда, действовать нужно и впрямь быстро. Что ж у меня еще осталось влияние в этом городе.
		Наместник опасается меня, а в совете остались люди, которые прислушиваются к моим доводам.
		Посмотрим, что можно сделать. Нужно подумать хотя бы немного.
		^
		Но советник так и не успевает подумать. Его согнутая над столом фигура резко выпрямляется
		в натянутую струну, чтобы тут же рухнуть прямо на разложенные документы. Под телом старика
		медленно растекается лужа крови, пропитывая собой бумаги.
		^
		Ты поворачиваешься и натыкаешься на насмешливый взгляд двух лиловых глаз на бледном лице.
		^
		-- Мы, кажется, разминулись, -- межленно произносит Полукровка.
		По её лицу пробегает тень улыбки.
		^
		-- Что ты наделала? -- только и можешь выдавить ты.
		^
		-- На твоём месте, я бы больше беспокоилась о том, что я собираюсь сделать.
		^
		Полукровка рывком достаёт метательный нож из спины советника чуть пониже шеи. Лужа
		крови продолжает увеличиваться.
		^
		-- Главаря тоже убила ты? -- твой взгляд прикован к тонким пальцам сжимающим нож.
		^
		-- К сожалению нет, но я пданировада и это, -- ответила она, закатив глаза,
		-- слишком часто он проигрывал мне в наших спорах.
		^
		-- Видимо, теперь моя очередь, -- ты вспоминаешь про копьё у тебя в руках и крепче
		хватаешься за древко.
		^
		-- Сложно сказать, -- девушка показывает тебе ровные белые зубы, -- в этом мире всё
		так зыбко и преходяще. Одно мгновение может разделить человека и страдание,
		человека и смерть. И он, в свою очередь, даже не сможет найти причину произошедшего.
		Перед глазами у него пронесётся вся его нелепая жизнь, а он так и не сможет осознать,
		почему же он умирает. О, воистину, мы не так представляем себе то, чего случиться
		не может. Ведь каждый из нас в глубине души верит, что он не сможет умереть.
		Но когда происходит именно это, тогда-то обнажается истинная реальность
		этого мира...
		^
		В её необычных лиловых глазах загорается огонь.
		^
		-- Ужас. Вот что правит бал в жизнях людей. Безопасность так иллюзорна,
		-- она вытирает нож о куртку крутки и прячет её в рукав,
		-- через пару часов этот город будет гореть в огне. Сможешь ли ты считать,
		что именно ты приложил руку к этой трагедии? Что не смог ей помешать?
		Думаю что не сможешь. Ведь тогда ты должен будешь считать себя <b>кем-то</b>.
		Краеугольным камнем судьбы, фигурой действия, не меньше.
		Но никак не безвольной марионеткой.
		^
		Она подходит к окну, раскрывает его, и бросает на тебя прощальный взгляд.
		^
		-- Теперь я оставлю тебя с мыслями об этом. Возможно мы ещё встретимся,
		дезертир. В этом мире возможно всё, когда речь идёт о смерти.
		^
		Полукровка шагает в окно и исчезает.
		В коридоре слышен топот подкованных железом сапог.
		^
		Через мгновение в комнату врываются трое городских стражников с мечами наголо.
		За стражниками входит лысый вояка в тяжёлом доспехе. Бросив взгляд на
		окровавленное тело советника на столе, он тоже извлекает меч из ножен.
		^
		-- Схватить его, -- бросает вояка команду стражникам.
	]];
	way = {
		'tower_stage5_corridor';
	};
	enter = function()
		if not have('tower_adviser_room_key') then
			return
			[[
				Ты осторожно пытаешься открыть дверь, но она не поддаётся.
				По ту сторону слышатся чьи-то шаги.
			]], false
		end
	end;
}

-- Дополнительная локация
tower_stage5_corridor = room {
	nam = 'Коридор';
	dsc = [[
		В отчаянии ты бросаешься на стражников с копём. Меч легко разрубает трухлявое
		древко, оставляя у тебя в руках нелепый обрубок. Следующий удар эфесом приходится
		тебе в висок, и ты падаешь во тьму.
		^
		Ты плохо помнишь, что было дальше. Кажется, тебя волокли по лестнице вниз.
		Потом были отсветы факелов на сырых каменных стенах. Ты приходил в себя несколько
		раз, от того что на голову тебе выливали ушат ледяной воды. В этот момент перед
		твоими глазами появлялось лицо лысого вояки изрезанное шрамами и морщинами.
		Он задавал тебе какие-то вопросы, ты пытался что-то ответить, но не мог. И снова
		проваливался во тьму.
		^
		В последнее своё пробуждение, ты увидел перед собой лицо капитана. Он сидел
		перед тобой на табурете и подбрасывал в воздух игральные
		кости.
		^
		-- Знаешь, этот советник очень много кому мешал, -- сказал тебе капитан,
		-- так что в некотором роде тебе даже благодарны.
		Но город такое преступление простить не может. Так что тебя ждёт эшафот.
		^
		Капитан расплывается во мраке.
	]];
	way = {
		'scaffold';
	};
}
