-- Локация
tower_stage5_adviser_room = room {
	nam = 'Комната советника';
	dsc = [[
		После пары вращений ключом в замке тебе удаётся совладать с дверью.
		Осторожно приоткрыв её, ты протискиваешься внутрь.
		^
		Эта комната заметно уступает в убранстве предыдущей, но выглядит не
		менее приятно. Здесь так же есть кровать, пара стульев, шкаф, тумбочка
		и большой письменный стол. Рядом со столом и замер седобородный старик
		с книгой в руке. Он смотрит на тебя с таким возмущением, что ты
		теряешь дар речи.
		^
		-- Интересно будет знать, как вы вошли?! -- гневно восклицает старик.
		^
		-- Советник, Конрой? -- шёпотом выдавливаешь ты из себя.
		^
		-- Да, это я. А кто вы такой, и что вы делаете в моих личных покоях?
		-- советник тоже переходит на шёпот, только этот шёпот в отличие от твоего
		прекрасно слышно, -- что, наместник прислал вас за мной, чтобы сопроводить
		на эшафот? Я надеялся, что конвой будет более солидный, и за мной пошлют
		хотя бы этого богоизбранного.
		^
		-- О, не беспокойтесь, советник, я не совсем солдат Режима,
		-- начинаешь оправдываться ты.
		^
		-- Как это понимать, не совсем солдат? Один сапог на вас армейский, а второй
		-- гражданский? -- продолжает кипятиться старик.
		^
		-- Послушайте, -- ты собираешься с мыслями, -- у нас очень мало времени, а я не мастер
		объяснений.
		^
		Ты поспешно достаёшь из-под нагрудника кипу документов, роняя несколько страниц на пол.
		^
		-- Пришёл рассказать вам о заговоре! Заговоре против Режима и против города! -- быстро
		произносишь ты, протягивая старику бумаги, -- вот, это переписка некоторых знатных лордов
		Приграничья и здешнего капитана Режима. Они планируют нападение на город. Возможно,
		это случится уже сегодня.
		^
		-- Что за вздор вы несёте? -- взрывается советник, но тут же успокаивается.
		Ты отдаёшь старику должное, он прекрасно владеет собой.
		^
		-- Ладно, кладите ваши бумаги.
		^
		Ты водружаешь документы на стол. Советник убирает книгу на тумбочку
		и подходит к тебе.
		^
		-- Так, что у нас тут, -- он начинает ловко разбирать стопку писем и бумаг, пробегая
		по ним глазами и раскладывая по столу. Старческие узловатые руки двигаются с завидной
		быстротой.
		^
		-- Все эти письма как будто настоящие. А фамилии и имена хорошо мне известны,
		-- задумчиво произносит старик, -- мне потребуется время, чтобы изучить
		всё это как следует.
		^
		-- Боюсь, у нас мало времени, советник, -- осторожно замечаешь ты.
		^
		-- Даже не знаю, что я могу сделать прямо сейчас, -- сокрушается он, -- если всё,
		что вы говорите правда, действовать нужно и впрямь быстро. Что ж у меня еще осталось
		влияние в этом городе. Наместник опасается меня, а в совете остались люди, которые
		прислушиваются к моим доводам. Посмотрим, что можно сделать.
		Нет, всё же, нужно подумать. Хотя бы немного.
		^
		Но советник так и не успевает подумать. Его согнутая над столом фигура резко выпрямляется
		в натянутую струну, чтобы тут же рухнуть прямо на тщательно разложенные документы.
		Под телом старика медленно растекается лужа крови, насыщая бумаги тёмно-красным цветом.
		^
		Ты поворачиваешься и натыкаешься на насмешливый взгляд двух лиловых глаз на бледном лице.
		^
		-- Мне кажется, или мы разминулись? -- цедит слова Полукровка.
		По её лицу пробегает тень улыбки.
		^
		-- Что ты наделала? -- только и можешь выдавить ты.
		^
		-- На твоём месте, я бы больше беспокоилась о том, что я собираюсь сделать.
		^
		Полукровка рывком достаёт метательный нож из спины советника чуть пониже шеи. Лужа
		крови на строле продолжает увеличиваться. Тебе кажется, что это не бумага впитвает
		кровь. Напротив, вязкая жидкость жадно поглощает документы, обращая все твои труды
		в ничто.
		^
		-- Главаря тоже убила ты? -- твой взгляд прикован к тонким пальцам сжимающим нож.
		^
		-- К сожалению нет, но признаюсь, избавится от него было в моих планах,
		-- ответила она, закатив глаза, -- не буду лукавить, я рассчитывала увидеть его
		здесь, рядом с тобой. Или вместо тебя. Но, увы, не всем планам суждено сбыться.
		В любом случае, его судьба была решена.
		^
		Она одаривает тебя холодным подобием улыбки и добавляет:
		^
		-- Слишком уж часто он проигрывал мне в наших спорах.
		^
		-- А что насчёт меня? Я с тобой ниочём не спорил, -- ты вспоминаешь про копьё
		у тебя в руках и крепче стискиваешь древко.
		^
		Ты не спускаешь с девушки взгляда, наблюда как она отступает к окну и раскрывает его.
		Поставив на подоконник ногу в высоком сапоге, она бросает на тебя прощальный взгляд.
		^
		-- Зато тебе, возможно, захочется поспорить с солдатами. Они как раз бегут сюда,
		чтобы схватить убийцу советника, -- Полукровка бросает на тебя прощальный взгляд,
		-- вижу, эта роль тебе не по вкусу. Извини, но мне не нужно, чтобы половина стражи
		гонялась за мной по городу. Так что попробуй убедить их, не убивать тебя на месте.
		Прощай, дезертир.
		^
		Девушка раскланивается в шутливом поклоне и исчезает в оконном проёме словно её
		и не было. В коридоре слышен топот подкованных железом сапог.
		^
		Через мгновение в комнату врываются трое городских стражников с мечами наголо.
		За стражниками входит лысый вояка в тяжёлом доспехе. Бросив взгляд на
		окровавленное тело советника на столе, он тоже извлекает меч из ножен.
		^
		-- Схватить его, -- бросает вояка команду стражникам.
	]];
	way = {
		'tower_stage5_corridor';
	};
	enter = function()
		if not have('tower_adviser_room_key') then
			return
			[[
				Ты осторожно пытаешься открыть дверь, но она не поддаётся.
				По ту сторону слышатся чьи-то шаги.
			]], false
		end
	end;
}

-- Дополнительная локация
tower_stage5_corridor = room {
	nam = 'Коридор';
	dsc = [[
		В отчаянии ты бросаешься на стражников с копём. Меч легко разрубает трухлявое
		древко, оставляя у тебя в руках нелепый обрубок. Следующий удар эфесом приходится
		тебе в висок, и ты падаешь во тьму.
		^
		Ты плохо помнишь, что было дальше. Кажется, тебя волокли по лестнице вниз.
		Потом были отсветы факелов на сырых каменных стенах. Ты приходил в себя несколько
		раз, от того что на голову тебе выливали ушат ледяной воды. В этот момент перед
		твоими глазами появлялось лицо лысого вояки изрезанное шрамами и морщинами.
		Он задавал тебе какие-то вопросы. Ты пытался что-то ответить, но не мог. И снова
		проваливался во тьму.
		^
		В последнее своё пробуждение, ты увидел перед собой капитана. Он сидел
		на табурете и подбрасывал в воздух игральные кости.
		^
		-- Знаешь, я не рассчитывал на такой исход. Но, видимо, это единственный твой
		талант -- оказываться не в том месте, не в то время.
		^
		Произнося это он даже не смотрел на тебя.
		^
		-- Я ничего не могу для тебя сделать. Да и не хочу. Убийство советника город
		спустить не может. Кто-то должен понести наказание. Тебя ждёт эшафот.
		Впрочем, не к нему ли ты шёл всю свою никчёмную жизнь?
		^
		Капитан расплывается во мраке.
	]];
	way = {
		'tower_stage5_to_scaffold';
		'tower_stage5_to_black_room';
	};
}

-- Локация для перехода на эшафот
tower_stage5_to_scaffold = room {
	nam = 'Площадь Режима';
	enter = function()
		walk 'scaffold';
	end;
}

-- Локация для перехода в чёрную команту
tower_stage5_to_black_room = room {
	nam = 'Чёрная комната';
	enter = function()
		walk 'black_room';
	end;
}
tower_stage5_to_black_room:disable();

-- Событие для включения второй концовки
on_event('black bird gift', function()
	tower_stage5_to_scaffold:disable();
	tower_stage5_to_black_room:enable();
end)
