-- Переменные локации
_thief_leader_quest = false
_thief_leader_has_gotten_help = false
_orc_is_angry = false

-- Переходы
bazaar_to_sewer = vroom('Сточная труба', 'sewer')
bazaar_to_sewer:disable()

-- Локация
bazaar = room {
	nam = 'Торговая площадь';
	dsc = [[
		Ты стоишь на торговой площади. Вокруг кипит жизнь. Среди рядов лотков-палаток
		снуют многочисленные покупатели в перемешку с попропошайками разного толка.
		Местные торговцы и заезжие купцы пытаются перекричать друг друга. Булочники
		катят тележки со своим товаром и предлагают продавцам и покупателям подкрепиться.
		^
		Ты замечаешь, что несмотря на переполненность площади, ты здесь единственный
		солдат Режима, что кажется тебе весьма странным.
	]];
	obj = {
		'bazaar_gamemaster';
		'bazaar_old_woman';
		'bazaar_jewels_saler';
		'bazaar_thief_leader';
		'bazaar_prystay_seller';
		'bazaar_competitors';
		'bazaar_wolf_man';
	};
	way = {
		'berlinstrasse';
		bazaar_to_sewer;
	};
}

-- События
-- Старуха делает предсказание
on_event('take prediction', function()
	-- Убираем старуху с рынка
	objs('bazaar'):del('bazaar_old_woman')
end)

-- Помогаем главарю воров, нейтрализуя конкурентов
on_event('help to thief leader', function()
	-- Убираем конкурентов с рынка
	objs('bazaar'):del('bazaar_competitors')
	-- Рязвязываем язык главарю воров
	_thief_leader_has_gotten_help = true
end)

-- Главарь воров нас признал и рассказал, как попасть в подполье
on_event('learned about guild', function()
	bazaar_to_sewer:enable()
end)

-- Объекты
-- Напёрсточник
bazaar_gamemaster = obj {
	nam = 'Напёрсточник';
	dsc = [[
		Залихватского вида {малый} предлагает всем желающим сыграть в напёрстки.
	]];
	act = [[
		-- Сыграть не хочешь, солдатик? -- подзывает он тебя.
		^
		-- Свалить не хочешь отсюда, отребье? -- огрызаешься ты.
		^
		-- Обижаешь, режимник, -- паренёк с нарочитой серьёзностью грозит тебе пальцем.
		^
		Ты замечаешь какое-то движение.
		^
		-- Пошёл к чёрту!
	]];
}

-- Старуха
bazaar_old_woman = obj {
	nam = 'Старуха';
	dsc = [[
		Неподалёку от него прямо на земле сидит {старуха} в лохмотьях,
		и то ли просит милостыню, то ли гадает.
	]];
	act = function()
		event 'take prediction';
		return [[
				Ты подходишь к старухе, чтобы расспросить, но понимаешь,
				что у тебя нет ни гроша.
				Ты собираешься было уйти, но она останавливает тебя жестом.
				^
				-- Подходи, не бойся. Солдатам Режима я будущее открывается бесплатно.
				^
				Она хватает тебя за руку и жадно впивается в неё взглядом.
				^
				-- Так, -- протягивает старуха, -- вижу, служишь ты долго. Ни детей, ни
				добра не нажил. Женщины рядом тоже не вижу, да и друзей у тебя нет.
				Предательство? Нет, предательства не вижу. Или вижу...
				^
				Внезапно, гадалка приходит в замешательство.
				^
				-- Погоди ка, а это что такое? Вижу дым, вижу пламя. Слышу крики.
				Что же это такое? -- она впивается своими длинными ногтями в твою
				ладонь, так что на коже проступает кровь. Ты криком выдёргиваешь руку.
				Но гадалка продолжает говорить.
				^
				-- Что же это? Пожар? -- она пристально смотрит прямо перед собой и
				внезапно вкакивает на ноги.
				^
				-- Пожар! Пожар! Горю!
				^
				Размахивая руками и крича гадалка бросается прочь, оставляя
				тебя потрясённым под множеством лобопытствующих взглядов.
		]];
	end;
}

-- Торговец камнями
bazaar_jewels_saler = obj {
	nam = 'Тоговец камнями';
	dsc = [[
		На краю площади стоит стол под навесом, за которым восседает
		вычурно одетый {торговец}.
	]];
	act = function()
		if not _orc_is_angry then
			-- Ты ещё не грубил орку
			_orc_is_angry = true
			return [[
				На большом столе скромно покоится искусно cделанная плоская шкатулка.
				Будучи раскрытой она являяет покупателю коллекцию драгоценных камней в
				оправах и без. В качестве защиты от рук камни покоятся под стеклянной крышкой,
				а сама шкатулка цепями крепится к столу. И всё равно такие меры предосторожности
				кажутся тебе незначительными на рынке под открытым небом и с прорвой народу. Если
				бы только рядом с торговцем не стоял огромный громила-орк, мелкие глазки которого
				буравили всякого, кто приближался к столу.
				^
				Рядом с тобой ещё один покупатель протягивает было руку, чтобы указать на
				понравишийся ему камень, как орк тут же издаёт что-то вроде рычания.
				Покупатель в страхе отшатывается от стола.
				^
				-- Без рук, пожалуйста, -- обходительно предупреждает хозяин шкатулки,
				-- Граннарк их выдирает с корнем. Пожалуйста, описывайте словами
				что вам показать.
				^
				-- Я быстрее описаю штаны, -- ворчливо отзывается покупатель и уходит.
				^
				-- Что-то не так? У меня всё по закону, -- обращается к тебе торговец.
				^
				-- А обезьяна дрессированная? -- спрашиваешь ты, кивая головой в сторону
				громилы. Орк в ответ свирепо скалит огромные клыки, а брови торговца
				переползают на лоб. Ты и сам удивляешься собственной дерзости.
				Кажется, этот герб на твоём нагруднике плохо на тебя влияет,
				ты снова ощущаешь себя солдатом Режима с мечом и полномочиями.
				Хотя сейчас ты всего лишь дезертир и меча у тебя никакого нет.
				^
				-- Это что, какая-то шутка? -- обиженно спрашивает торговец, --
				Хотите, чтобы Граннарк здесь всё разнёс? Оставил меня без гроша
				в кармане, да ещё и в тюрьме, а стража Режима без некоторых частей тела?
				^
				-- Удачного дня, -- отвечаешь ты, поспешно ретируясь.
			]];
		end
		-- Ты нагрубил орку
		return [[
			Кажется, ты видел как торговец давал орку какое-то пойло, чтобы успокоить.
			И всё равно тебе больше не хочется связываться с ними.
		]]
	end;
}

-- Главарь воров
bazaar_thief_leader = obj {
	nam = 'Главарь воров';
	dsc = [[
		Дальше в ряду палатка {смуглого мужчины} с чёрной щетиной. Он курит трубку, подолгу провожая
		взглядом каждого прохожего и приятельски улыбаясь.
	]];
	act = function()
		-- Проверяем не давал ли главарь нам задания
		if _thief_leader_quest then
			return [[
				-- Как там подозрительные торговцы из Вольных городов? --
				подмигивает тебе торгаш.
			]];
		end;
		-- Если мы ещё не помогли главарю воров, то он просит нас помочь
		if not _thief_leader_has_gotten_help then
			-- Главарь воров даёт нам задание
			_thief_leader_quest = true
			if _orc_is_angry then
				talk_about_orc = [[
					-- Похоже, у стражей Режима мало проблем, если они решают
					позлить орка. Только вчера же двое умников хотели
					утащить пару камушков. Один думал въехать в стол
					тележкой и удрать от орка, а второй в суматохе разбить
					камнем стекло шкатуклки и прибарахлиться. В итоге
					первый безуспешно бежал не от орка, а от его топора.
					А второму разбил голову орочий кулак, -- торгаш
					усмехнулся, выпустив кольцо дыма, -- зачем ко мне
					пожаловал-то?
					^
				]]
			else
				talk_about_orc = ''
			end;
			return talk_about_orc .. [[
				Не видели ли вы в последнее время кого-нибудь подозрительного?
				^
				Торгаш смеряет тебя хитрым взглядом.
				^
				-- Кажется, я понимаю к чему ты клонишь, приятель.
				Вон те купцы из Вольных городов очень подозрительные, всех покупателей
				у меня отбили. Мне кажется, что-то у них нечисто.
				^
				-- Что же?
				^
				-- А ты пораспрашивай сначала их,
				вдруг у них какие-то проблемы там с законом обнаружатся
				и им срочно потребуется покинуть город. Понимаешь, о чём я?
				Как проверишь, так приходи опять ко мне, и я расскажу тебe
				что про действительно подозрительное.
			]];
		else
			-- Иначе рассказывает, как попасть в подполье
			event 'learned about guild';
			return [[
				-- Ловко ты отвадил этих вольных купцов.
				^
				-- Хочешь узнать кое-что подозрительное? У тебя какое-то
				подозрительно знакомо-незнакомое лицо...
				Я стараюсь узнать
				в лицо каждого рекрута Режима, а память на лица у меня очень хорошая. Но
				тебя я не припоминаю и в то же время, где-то я тебя видел. А верно, ты
				один из дезертиров в розыске.
			]];
		end
	end;
}

-- Продавец пряностей
bazaar_prystay_seller = obj {
	nam = 'Продавец пряностей';
	dsc = [[
		Твоё внимание обращает на себя {продавец пряностей},
		который зазывает покупателей громче всех.
	]];
	act = function()
		walk 'bazaar_stories'
	end;
}

-- Конкуренты главаря воров
bazaar_competitors = obj {
	nam = 'Купцы из Вольныз городов';
	dsc = [[
		Больше шума чем от него только от каких-то странствующих {купцов},
		лопочущих на непонятном языке.
	]];
	act = [[
		Просто из интереса ты подходишь к купцам и пытаешься завязать разговор.
		*Разговаривают с тобой на непонятном языке, дружески похлопывают по плечу,
		предлагают выпить.
		^
		Ты уверен, что над тобой издеваются.
	]];
	-- Подкидываем купцам субстрат
	used = function(self, what)
		if what == magic_substrate then
			inv():del 'magic_substrate'
			event 'help to thief leader'
			return [[
				-- О так вы оказывается знаете общий язык!
			]]
		end
	end;
}

-- Человек в волчьей шкуре
bazaar_wolf_man = obj {
	nam = 'Человек в костюме из волчьей шкуры';
	dsc = [[
		На отшибе странного вида {человек} в волчьей шкуре, варит что-то в большом
		котелке на углях. Большая часть прохожих с удивлением поглядывают на эти
		таинства кулинарии и крутит пальцем у виска.
		Человек отвечает им оскалом морды волка, расположившейся у него на голове.
	]];
	act = [[
		Ты подходишь к повару и наблюдаешь, как он плавно помешивает варево в котелке.
		Тебе начинает казаться, что жидкость излучает свечение.
		^
		-- А это ещё что? -- ты обращаешь внимание на стол заваленный всяческими
		костями и перьями.
		^
		-- Амулеты орков, -- отвечает торговец. Только теперь ты замечаешь,
		что его лицо и руки густо покрыты татуировками, -- они способны наделять
		свого владельца разными силами...
	]];
}

-- TODO
berlinstrasse_todo = obj {
	nam = 'Todo';
	dsc = [[
		{...}
	]];
	act = function()
		return [[
			- Воспоминания ГГ о городах Приграничья и людях. Нужно влюбить игрока в город, чтобы он сопереживал его гибели в огне;
			^
			- куча НПС с которыми ты можешь поговорить, помимо мененстреля и глашатая;
			^
			- Будучи солдатом Режима, ГГ расспрашивает всех о подозрительных личностях и гильдии воров;
			^
			- Добавить купцов из Вольных городов и возможность подбросить им субстрат;
			^
			- Торговец-вор будет сотрудничать, только если ГГ нейтрализует его конкурентов;
		]];
	end;
}
