berlinstrasse = room {
	nam = 'Главная улица';
	dsc = [[
		Ты стоишь на главной улице города. Сразу понятно, что она главная,
		потому что улица тут же говорит тебе, что ты скотина и вообще
		ничего из себя не представляешь.
		^
		(Улица ведёт к башне Наместника: мрачное описание?)
		^
		(куча НПС с которыми ты можешь поговорить)
		^
		- Старик книжник Прираничья -- диалоги о Книжниках, истории Приграничья, цели Книжника (исселовать город);
		- Мальчишка;
		- Группа мужчин;
		^
		(Вместе с необходимости влюбить игрока в город, нужно и покачнуть его уверенность в реальности города. Иллюзии мирной жизни)
	]];
	obj = {
		-- ^_^
	};
	way = {
		'regimenstrasse';
		'bazaar';
	};
}
